[
  {
    "id": "access-2022",
    "badge": "IEEE Access",
    "badgeClass": "ieee",
    "type": "journal",
    "title": "Automatic Emotion Recognition From Multi-Band EEG Data Based on a Deep Learning Scheme With Effective Channel Attention",
    "authors": ["Oishy Saha", "Md. Sultan Mahmud", "Shaikh A. Fattah", "Mohammad Saquib"],
    "venue": "IEEE Access",
    "year": 2023,
    "date": "2023-01-15",
    "volume": "11",
    "pages": "2342–2350",
    "doi": "10.1109/ACCESS.2022.3224725",
    "links": {
      "html": "https://ieeexplore.ieee.org/abstract/document/9963974",
      "pdf": "",
      "code": ""
    },
    "abstract": "Automatic emotion recognition using electroencephalogram (EEG) has obtained a wide range of attention in the domain of human-computer interaction (HCI) owing to the notable differences in brain activities in the event of different types of emotions. In this paper, a novel emotion recognition approach is proposed based on a deep learning scheme utilizing the temporal, spatial, and frequency effects of the EEG signal. As neural firing provides a pathway to elicit emotions, temporal, spatial, and frequency sub-band analysis of EEG signals uncovers salient information to categorize different classes of emotions. In this regard, temporal data from each channel are divided into major spectral bands and 2D signal matrices are constructed by combining the temporal information of different frequency band signals. After concatenating all signal matrices obtained from the available channels, a 3D feature space is obtained, which can better characterize emotion variations and, thus, better classification performance is obtained. The feature space is applied to a 2D deep neural network where the band information is passed to the depth dimension of the neural network. In order to highlight the important channels, a channel attention mechanism is proposed with the neural network to distribute the weights among the channels according to the contribution. Hence, the modified feature space effectively captures distinctive information about specific channels in the context of emotion recognition. In this study, detailed and extensive experimentations are carried out on a publicly available DEAP dataset and a very satisfactory performance is obtained for the valence and the arousal domain in 2-class scenario for the subject-dependent case. The average accuracies obtained for valence and arousal domain in binary class problem are 97.06% and 96.93%, respectively.",
    "bibtex": "@ARTICLE{9963974,\n  author={Saha, Oishy and Mahmud, Md. Sultan and Fattah, Shaikh Anowarul and Saquib, Mohammad},\n  journal={IEEE Access},\n  title={Automatic Emotion Recognition From Multi-Band EEG Data Based on a Deep Learning Scheme With Effective Channel Attention},\n  year={2023},\n  volume={11},\n  pages={2342-2350},\n  doi={10.1109/ACCESS.2022.3224725}\n}"
  },
  {
    "id": "bpee-2024",
    "badge": "Journal",
    "badgeClass": "ieee",
    "type": "journal",
    "title": "Emotion Recognition with Reduced Channels Using CWT-Based EEG Feature Representation and a CNN Classifier",
    "authors": ["Md. Sultan Mahmud", "Shaikh A. Fattah", "Md. Saquib", "Oishy Saha"],
    "venue": "Biomedical Physics & Engineering Express",
    "year": 2024,
    "links": {
      "html": "",
      "pdf": "",
      "code": ""
    },
    "abstract": "Placeholder abstract.",
    "bibtex": "@article{Mahmud2024BPEE,\n  title={Emotion Recognition with Reduced Channels Using CWT-Based EEG Feature Representation and a CNN Classifier},\n  author={Mahmud, Md. Sakhawat and Fattah, Shaikh A. and Saquib, Md. and Saha, Oishy},\n  journal={Biomedical Physics & Engineering Express},\n  year={2024}\n}"
  },
  {
    "id": "tencon-2020",
    "badge": "IEEE TENCON",
    "badgeClass": "arxiv",
    "type": "conference",
    "title": "A Multi-Model Based Ensembling Approach to Detect COVID-19 from Chest X-ray Image",
    "authors": ["Oishy Saha", "J. Tasnim", "M. T. Raihan", "T. Mahmud", "I. Ahmmed", "S. A. Fattah"],
    "venue": "TENCON 2020 - IEEE Region 10 Conference",
    "year": 2020,
    "links": { "html": "", "pdf": "", "code": "" },
    "abstract": "Placeholder abstract.",
    "bibtex": "@inproceedings{Saha2020TENCON,\n  title={A Multi-Model Based Ensembling Approach to Detect COVID-19 from Chest X-ray Image},\n  author={Saha, Oishy and Tasnim, J. and Raihan, M. T. and Mahmud, T. and Ahmmed, I. and Fattah, S. A.},\n  booktitle={TENCON 2020 - IEEE Region 10 Conference},\n  year={2020}\n}"
  },
  {
    "id": "wiecon-2022",
    "badge": "WIECON",
    "badgeClass": "conf",
    "type": "conference",
    "title": "DEEPSATTNET: An Efficient Deep Neural Network with Self-Attention Mechanism for Emotion Recognition Utilizing EEG Signal",
    "authors": ["Oishy Saha", "et al."],
    "venue": "IEEE WIECON-ECE — Best Paper Award",
    "year": 2022,
    "links": { "html": "", "pdf": "", "code": "" },
    "abstract": "Placeholder abstract.",
    "bibtex": "@inproceedings{Saha2022WIECON,\n  title={DEEPSATTNET: An Efficient Deep Neural Network with Self-Attention Mechanism for Emotion Recognition Utilizing EEG Signal},\n  author={Saha, Oishy and coauthors},\n  booktitle={IEEE WIECON-ECE},\n  year={2022}\n}"
  }
]
